cask_args appdir: "/Applications"

# Version control
brew "git"
brew "hub"
brew "jj"

# Compilation, etc.
brew "openssl"
brew "pkgconfig"
brew "autoconf"
brew "automake"
brew "libtool"
brew "coreutils"
brew "cmake"
brew "shared-mime-info"

# Tools Management
brew "mise"
brew "nodejs"

# Other utilities
brew "redis"

# Browsers
cask "google-chrome"
cask "firefox@developer-edition"

# Development tools
brew "vim"
brew "nvim"
brew "ripgrep"
brew "tmux"
brew "zellij"
cask "sourcetree"
cask "ghostty"
cask "orbstack"
cask "zed"

# Other tools
brew "fish"
cask "1password"
cask "rocket"
