cask_args appdir: "/Applications"

tap "homebrew/cask-versions"

# Version control
brew "git"
brew "hub"

# Compilation, etc.
brew "openssl"
brew "pkgconfig"
brew "autoconf"
brew "automake"
brew "libtool"
brew "coreutils"
brew "cmake"

# Ruby
brew "rbenv"
brew "ruby-build"

# Node
brew "nodejs"
brew "nodenv"
brew "node-build"

# Other utilities
brew "redis"

# Binary utilities
cask "postgres"

# Browsers
cask "google-chrome"
cask "firefox-developer-edition"

# Development tools
brew "vim"
brew "nvim"
brew "ripgrep"
cask "sourcetree"
cask "iterm2"
cask "visual-studio-code"
cask "docker"

# Other tools
brew "fish"
cask "1password"
cask "bartender"
cask "microsoft-office"
cask "rocket"
